In [24]:
import pandas as pd
#create dataframe
data = {'company':['GooG','Name','Name','msf','msf'],
       'Person':['Sam','Paul','Charit','sabhavi','Anmol'],
       'Sales':['250','222','251','221','211']}

In [25]:
df=pd.DataFrame(data, dtype=float)

In [26]:
df

  company   Person  Sales
0    GooG      Sam  250.0
1    Name     Paul  222.0
2    Name   Charit  251.0
3     msf  sabhavi  221.0
4     msf    Anmol  211.0

In [27]:
df.groupby('company')

In [28]:
x= df.groupby('company')

In [29]:
x.mean()

         Sales
company
GooG     250.0
Name     236.5
msf      216.0

In [30]:
x.std()

             Sales
company
GooG           NaN
Name     20.506097
msf       7.071068

In [31]:
x.describe()

        Sales
        count   mean        std    min     25%    50%     75%    max
company
GooG      1.0  250.0        NaN  250.0  250.00  250.0  250.00  250.0
Name      2.0  236.5  20.506097  222.0  229.25  236.5  243.75  251.0
msf       2.0  216.0   7.071068  211.0  213.50  216.0  218.50  221.0

In [32]:
x.describe().transpose()

company       GooG        Name         msf
Sales count    1.0    2.000000    2.000000
      mean   250.0  236.500000  216.000000
      std      NaN   20.506097    7.071068
      min    250.0  222.000000  211.000000
      25%    250.0  229.250000  213.500000
      50%    250.0  236.500000  216.000000
      75%    250.0  243.750000  218.500000
      max    250.0  251.000000  221.000000

In [40]:
#merging and joining
new = {'company':['GooG','Name','Name','msf','msf'],
       'Person':['Sam','Paul','Charit','sabhavi','Anmol'],
       'Index':['111','112','113','114','115']}
nue = {'company':['GooG','Name','Name','msf','msf'],
       'Person':['Sam','Paul','Charit','sabhavi','Anmol'],
       'Index':['211','212','213','214','215']}

In [41]:
df=pd.DataFrame(new, dtype=float)

In [42]:
df

  company   Person  Index
0    GooG      Sam  111.0
1    Name     Paul  112.0
2    Name   Charit  113.0
3     msf  sabhavi  114.0
4     msf    Anmol  115.0

In [43]:
df2=pd.DataFrame(nue, dtype=float)

In [44]:
df2

  company   Person  Index
0    GooG      Sam  211.0
1    Name     Paul  212.0
2    Name   Charit  213.0
3     msf  sabhavi  214.0
4     msf    Anmol  215.0

In [48]:
pd.merge(df,df2,how='outer')#use to renmove duplicate

  company   Person  Index
0    GooG      Sam  111.0
1    Name     Paul  112.0
2    Name   Charit  113.0
3     msf  sabhavi  114.0
4     msf    Anmol  115.0
5    GooG      Sam  211.0
6    Name     Paul  212.0
7    Name   Charit  213.0
8     msf  sabhavi  214.0
9     msf    Anmol  215.0

In [51]:
#joining dictionary 
df1 = pd.DataFrame({'Int':[2,1,2,3],'Ind_GDP':[50,39,43,56]})
print(df1)
df2 = pd.DataFrame({'Int':[2,1,2,3],'Ind_GDP':[50,39,43,56]})
print(df1)
joined=df1.join(df2)

NameError: name 'Merge' is not defined

In [ ]:
var=pd.DataFrame({'day':[1,2,3,4,5],'Visitors':['1000','2000','700','876','123']})
d=var.rename(columns{"Visitors":"users"})